InformationRegisters/ПредставленияОснованийУвольнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПредставленияОснованийУвольнения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектСНастраиваемымПредставлением</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияРегистрацийВОрганеПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРегистрацийВОрганеПФР</Name>
			<InformationRegisterPeriodicity>Quarter</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТерриториальныеУсловияПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ТерриториальныеУсловияПФР</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТерриториальныеУсловияПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриториальныеУсловияПФР</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияВыполненияРабот</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЭлектронныеТрудовыеКнижкиПовтИсп/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция СвойстваДолжности(Должность) Экспорт
	
	Свойства = Новый Структура("Представление,КодПоРееструДолжностей");
	
	Если ЗначениеЗаполнено(Должность) Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Должность, "Наименование,НаименованиеДляЗаписейОТрудовойДеятельности");
		
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.НаименованиеДляЗаписейОТрудовойДеятельности) Тогда
			Свойства.Представление = ЗначенияРеквизитов.НаименованиеДляЗаписейОТрудовойДеятельности;
		Иначе
			Свойства.Представление = ЗначенияРеквизитов.Наименование;
		КонецЕсли;
		
		Свойства.КодПоРееструДолжностей = ЭлектронныеТрудовыеКнижки.КодДолжностиПоРееструГосударственнойСлужбы(Должность);
		
	КонецЕсли;
	
	Возврат Свойства;
	
КонецФункции

Функция ПредставлениеПодразделения(Подразделение) Экспорт
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат "";
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Подразделение, "Наименование,НаименованиеДляЗаписейОТрудовойДеятельности");
	
	Если ЗначениеЗаполнено(ЗначенияРеквизитов.НаименованиеДляЗаписейОТрудовойДеятельности) Тогда
		Возврат ЗначенияРеквизитов.НаименованиеДляЗаписейОТрудовойДеятельности;
	КонецЕсли;
	
	Возврат ЗначенияРеквизитов.Наименование;
	
КонецФункции

Функция СвойстваОснованияУвольнения(ОснованиеУвольнения) Экспорт
	
	СвойстваОснования = Новый Структура(
		"ОснованиеУвольненияНаименованиеОснования,
		|ОснованиеУвольненияТекстОснования,
		|ОснованиеУвольненияСтатья,
		|ОснованиеУвольненияЧасть,
		|ОснованиеУвольненияПункт,
		|ОснованиеУвольненияПодпункт,
		|ОснованиеУвольненияАбзац");
	
	Если ЗначениеЗаполнено(ОснованиеУвольнения) Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ОснованиеУвольнения, "ТекстОснования,Статья,Часть,Пункт,Подпункт,Абзац");
		
		СвойстваОснования.ОснованиеУвольненияТекстОснования = ЗначенияРеквизитов.ТекстОснования;
		СвойстваОснования.ОснованиеУвольненияСтатья = ЗначенияРеквизитов.Статья;
		СвойстваОснования.ОснованиеУвольненияЧасть = ЗначенияРеквизитов.Часть;
		СвойстваОснования.ОснованиеУвольненияПункт = ЗначенияРеквизитов.Пункт;
		СвойстваОснования.ОснованиеУвольненияПодпункт = ЗначенияРеквизитов.Подпункт;
		СвойстваОснования.ОснованиеУвольненияАбзац = ЗначенияРеквизитов.Абзац;
		
		Если ТипЗнч(ОснованиеУвольнения) <> Тип("СправочникСсылка.ОснованияУвольненияПользовательские") Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", ОснованиеУвольнения);
			
			Запрос.Текст =
				"ВЫБРАТЬ
				|	Представления.ТекстОснования КАК ТекстОснования,
				|	Представления.Наименование КАК Наименование
				|ИЗ
				|	РегистрСведений.ПредставленияОснованийУвольнения КАК Представления
				|ГДЕ
				|	Представления.Использовать
				|	И Представления.Объект = &Ссылка";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				СвойстваОснования.ОснованиеУвольненияНаименованиеОснования = Выборка.Наименование;
				СвойстваОснования.ОснованиеУвольненияТекстОснования = Выборка.ТекстОснования;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат СвойстваОснования;
	
КонецФункции

Функция НеЗаполнятьПодразделенияВМероприятияхТрудовойДеятельности(Организация) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "НеЗаполнятьПодразделенияВМероприятияхТрудовойДеятельности");
	Если ТипЗнч(ЗначениеРеквизита) <> Тип("Булево") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЗначениеРеквизита;
	
КонецФункции

Функция НастройкиЭлектронныхТрудовыхКнижек() Экспорт
	
	ЗаписьНастроек = РегистрыСведений.НастройкиЭлектронныхТрудовыхКнижек.СоздатьМенеджерЗаписи();
	ЗаписьНастроек.Прочитать();
	
	Настройки = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(ЗаписьНастроек, Метаданные.РегистрыСведений.НастройкиЭлектронныхТрудовыхКнижек);
	
	Возврат Настройки;
	
КонецФункции

Функция ПредставлениеРазрядаКатегории(РазрядКатегория) Экспорт
	
	Если Не ЗначениеЗаполнено(РазрядКатегория) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ЭлектронныеТрудовыеКнижки.ПредставлениеРазрядаКатегории(РазрядКатегория);
	
КонецФункции

Функция ОрганизацияПоРегистрационномуНомеруПФР(РегистрационныйНомерПФР) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РегистрационныйНомерПФР", РегистрационныйНомерПФР);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИсторияРегистрацийВОрганеПФР.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ИсторияРегистрацийВОрганеПФР КАК ИсторияРегистрацийВОрганеПФР
		|ГДЕ
		|	НЕ ИсторияРегистрацийВОрганеПФР.Организация.ПометкаУдаления
		|	И ИсторияРегистрацийВОрганеПФР.РегистрационныйНомерПФР = &РегистрационныйНомерПФР";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Организация;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ТерриториальныеУсловияПФР(ДатаМероприятия, Организация, Подразделение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаМероприятия", ДатаМероприятия);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Подразделение);
	ИначеЕсли ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Организация);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТерриториальныеУсловия.ТерриториальныеУсловияПФР КАК ТерриториальныеУсловияПФР
		|ИЗ
		|	РегистрСведений.ТерриториальныеУсловияПФР.СрезПоследних(&ДатаМероприятия, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ТерриториальныеУсловия";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ТерриториальныеУсловияПФР = Справочники.ТерриториальныеУсловияПФР.МКС
			Или Выборка.ТерриториальныеУсловияПФР = Справочники.ТерриториальныеУсловияПФР.РКС Тогда
			
			Возврат Выборка.ТерриториальныеУсловияПФР;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция КодПоОКЗТрудовойФункции(ТрудоваяФункция) Экспорт
	
	Если ЗначениеЗаполнено(ТрудоваяФункция) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТрудоваяФункция, "КодПоОКЗ");
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПредставлениеКодаОКЗ(КодПоОКЗ) Экспорт
	
	Если Не ЗначениеЗаполнено(КодПоОКЗ) Тогда
		Возврат "";
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КодПоОКЗ, "Код,КонтрольноеЧисло");
	Возврат ЗначенияРеквизитов.Код + "." + ЗначенияРеквизитов.КонтрольноеЧисло;
	
КонецФункции

Функция ПричинаУвольненияПФР(ОснованиеУвольнения) Экспорт
	
	Если ЗначениеЗаполнено(ОснованиеУвольнения) Тогда
		ПричинаУвольненияПФР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОснованиеУвольнения, "ПричинаУвольненияПФР");
		Если ЗначениеЗаполнено(ПричинаУвольненияПФР) Тогда
			Возврат ПричинаУвольненияПФР;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.ПричиныУвольненияПФР.Иное;
	
КонецФункции

#КонецОбласти
